{
  "Type": "MultipleChoice",
  "ScoreAwarded": 1.0,
  "CorrectAnswer": "B,D",
  "Text": {
	"It": "Ti trovi da un cliente per valutare insieme a lui le tecnologie da usare nello sviluppo di una nuova applicazione. Nel suo datacenter ci sono solo server Linux e sembra contrario ad usare software proprietario. Che argomenti usi per convincerlo ad usare il .NET Core come piattaforma di sviluppo, che ti permetterebbe di impiegare le tue competenze in C#?",
	"En": "You are at your customer's office and you are evaluating with him which technologies to use for his next application. In his datacenter there are just Linux servers and he tells you he prefers not to use proprietary software. What arguments will you use to convince him that the .NET Core would be an ideal platform to develop for?"
  },
  "AnswerText": {
	"It": "Il .NET Core è gratuito ed open-source, quindi non richiede l'acquisto di alcuna licenza, neanche per grandi progetti.  
Inoltre, è multipiattaforma e quindi il cliente non dovrà acquistare nessuna licenza di Windows Server ma potrà riutilizzare i suoi server Linux.  

**Materiale di studio**

[Lezione 1, slide 23](https://slack-files.com/files-pri/T4LSU7RKJ-F4MLLGSJW/01-lezione-dotnetcore.pdf#page=23)",
	"En": "The .NET Core is free and open-source so it won't require the purchase of a commercial license, even for large projects.  
Also, it's a multi-platform technology so your customer won't need to purchase a Windows Server license either but it will be able to use his existing Linux machines.",
  },
  "Group": "01",
  "Options": [
	{ "Id": "A", "Text": { "It": "Il .NET Core ha dei costi di licenza per i grandi progetti ma sono bassi", "En": "The .NET Core has a license cost for large projects, but it's cheap" } },
	{ "Id": "B", "Text": { "It": "Il .NET Core è multipiattaforma e quindi può funzionare sui server Linux", "En": "The .NET Core is multi-platform and can work on Linux servers" } },
	{ "Id": "C", "Text": { "It": "Il .NET Core richiede Windows Server ma dato che è una tecnologia snella basterà comprarne solo una copia", "En": "The .NET Core requires a Windows Server but since is a technology with a small footprint, it will just need one license" } },
	{ "Id": "D", "Text": { "It": "Il .NET Core è open-source, non ci sono parti proprietarie", "En": "The .NET Core is open-source, it's not a proprietary technology" } }
  ]
}