{
  "Type": "MultipleChoice",
  "ScoreAwarded": 1.0,
  "CorrectAnswer": "A,C,F",
  "Text": {
	"It": "Indica quali, tra queste, sono operazioni _asincrone_ e che perciò trarrebbero il massimo beneficio dall'uso delle parole chiave `async` e `await`.",
	"En": ""
  },
  "AnswerText": {
	"It": "Un'operazione si dice _asincrona_ quando il thread che sta eseguendo la nostra applicazione deve aspettare un certo tempo che arrivi un risultato da periferiche di I/O, come la scheda di rete o il disco fisso.  

Ogni operazione che richiede un uso attivo della CPU o della memoria RAM non è considerata asincrona perché il thread corrente è già attivamente impegnato a portare a compimento l'elaborazione nel minor tempo possibile.  

`Inviare una query ad un database` è un'operazione asincrona perché il thread deve attendere che i dati siano letti dal disco fisco (se il db si trova sulla stessa macchina in cui si trova l'applicazione) oppure dalla scheda di rete (se il db si trova su un'altra macchina);  
`Inviare una richiesta ad un webservice` è anch'essa un'operazione asincrona perché è richiesto scambio dati via rete internet o intranet e queste operazioni hanno una latenza misurabile in millisecondi, tempo in cui il thread può dedicarsi ad altro;  
`Attendere 1 secondo` è anch'essa un'operazione asincrona perché il fatto stesso dell'attesa non tiene impegnato il thread corrente, che così può fare altro.  

`Ridimensionare un'immagine JPG`, invece, è un'operazione sincrona perché richiede un'elaborazione da parte della CPU per calcolare i valori RGB di ogni pixel dell'immagine ridimensionata;  
`Calcolare le prime mille cifre del PI greco` è sincrona perché, anche in questo caso, il thread è completamente impegnato a compiere calcoli matematici sulla CPU;  
`Ordinare una lista di oggetti in memoria` è sincrona perché gli oggetti si trovano già in RAM, pronti ad assere acceduti dall'algoritmo che effettuerà l'ordinamento confrontando i valori dei vari oggetti.  

**Materiale di studio**

[Lezione 7, slide 12](https://files.slack.com/files-pri/T4LSU7RKJ-F56QEGDR7/07-lezione-async-await-entityframework.pdf#page=12)",
	"En": "",
  },
  "Group": "07",
  "Options": [
	{ "Id": "A", "Text": { "It": "Inviare una query ad un database", "En": "" } },
	{ "Id": "B", "Text": { "It": "Ridimensionare un'immagine JPG", "En": "" } },
	{ "Id": "C", "Text": { "It": "Inviare una richiesta ad un webservice", "En": "" } },
	{ "Id": "D", "Text": { "It": "Calcolare le prime mille cifre del PI greco", "En": "" } },
	{ "Id": "E", "Text": { "It": "Ordinare una lista di oggetti in memoria", "En": "" } },
	{ "Id": "F", "Text": { "It": "Attendere 1 secondo prima di riprovare a compiere un'operazione che era fallita", "En": "" } }
  ]
}