{
  "Type": "MultipleChoice",
  "ScoreAwarded": 1.0,
  "CorrectAnswer": "D",
  "Text": {
	"It": "Hai ideato un nuovo algortimo di compressione e lo vuoi distribuire come pacchetto NuGet affinché tutti gli altri sviluppatori lo possano reimpiegare nei loro progetti. Il cuore del tuo algoritmo l'hai modellato con una classe molto complicata chiamata `CompressionEngine` che viene usata da tante altre classi più semplici nel tuo progetto. Tuttavia, proprio per il fatto che è molto complicata e solo tu sapresti come usarla opportunamente, decidi di non esporla a tutti, in modo che per gli altri sviluppatori sia impossibile usarla direttamente. Invece, la useranno indirettamente senza saperlo grazie alle altri classi più semplici che hai deciso di esporre. Che tipo di accessore scegli per la classe `CompressionEngine`?",
	"En": ""
  },
  "AnswerText": {
	"It": "L'accessore `internal` permette ad una classe di essere visibile solo alle altre classi dello stesso assembly. In questo modo riesci facilmente ad usarla dalle altre classi del tuo progetto ma diventa inaccessibile da altri progetti che referenziano il tuo assembly.  
L'accessore `public` non è idoneo in questo caso, in quanto la classe `CompressionEngine` risulterebbe liberamente accessibile da qualunque progetto.  
Gli accessori `private`	e `protected` renderebbero `CompressionEngine` inaccessibile anche alle altre classi del tuo progetto. In C#, gli accessori `private`	e `protected` hanno senso solo per le classi solo sono state definite all'interno di un'altra classe (le classi si possono annidare). L'utilizzo più comune che si fa di `private` e `protected` è sui _membri_ di una classe, come proprietà e metodi.

**Materiale di studio**

[Lezione 3, slide 14](https://files.slack.com/files-pri/T4LSU7RKJ-F4TDZ36UR/03-lezione-modellazione-testing.pdf#page=14)",
	"En": "",
  },
  "Group": "03",
  "Options": [
	{ "Id": "A", "Text": { "It": "public", "En": "" } },
	{ "Id": "B", "Text": { "It": "protected", "En": "" } },
	{ "Id": "C", "Text": { "It": "private", "En": "" } },
	{ "Id": "D", "Text": { "It": "internal", "En": "" } }
  ]
}